alibaba/AliOS-Things/board/m400/hal/m400_hw.c
/*
 / _____)             _              | |
 ( (____  _____ ____ _| |_ _____  ____| |__
 \____ \| ___ |    (_   _) ___ |/ ___)  _ \
 _____) ) ____| | | || |_| ____( (___| | | |
 (______/|_____)_|_|_| \__)_____)\____)_| |_|
 (C)2013 Semtech

 Description: Target board general functions implementation

 License: Revised BSD License, see LICENSE.TXT file include in the project

 Maintainer: Miguel Luis and Gregory Cristian
 */
/*******************************************************************************
 * @file    eml3047_hw.c
 * @author  MCD Application Team
 * @version V1.1.1
 * @date    01-June-2017
 * @brief   system hardware driver
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2017 STMicroelectronics International N.V.
 * All rights reserved.</center></h2>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted, provided that the following conditions are met:
 *
 * 1. Redistribution of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 * 3. Neither the name of STMicroelectronics nor the names of other
 *    contributors to this software may be used to endorse or promote products
 *    derived from this software without specific written permission.
 * 4. This software, including modifications and/or derivative works of this
 *    software, must execute solely and exclusively on microcontroller or
 *    microprocessor devices manufactured by or for STMicroelectronics.
 * 5. Redistribution and use of this software other than as permitted under
 *    this license is void and will automatically terminate your rights under
 *    this license.
 *
 * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A
 * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
 * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT
 * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
 * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
 * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
 * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 ******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "hw.h"
#include "radio.h"
#include "debug.h"
#include "vcom.h"

/* Force include of hal adc in order to inherite HAL_ADC_STATE_xxx */
#include "stm32l0xx_hal_dma.h"
#include "stm32l0xx_hal_adc.h"

#include <k_api.h>

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/**
 * @brief  Unique Devices IDs register set ( STM32L0xxx )
 */
#define ID1 (UID_BASE)
#define ID2 (UID_BASE + 0x4)
#define ID3 (UID_BASE + 0x14)

/**
 * @brief  ADC Vbat measurement constants
 */
/* Internal voltage reference, parameter VREFINT_CAL*/
#define VREFINT_CAL ((uint16_t *)((uint32_t)0x1FF80078))
#define LORAWAN_MAX_BAT 254

/**
 * @brief  Delay for ADC stabilization time. Maximum delay is 1us
 *         (refer to device datasheet, parameter tSTART).
 * @note   Unit: us
 */
#define ADC_STAB_DELAY_US ((uint32_t)1U)

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/**
 * @brief  State of the ADC
 */
__IO uint32_t adc_state;

/**
 * @brief  Flag to indicate if the ADC is Initialized
 */
static FlagStatus AdcInitialized = RESET;

/**
 * @brief  Flag to indicate if the MCU is Initialized
 */
static FlagStatus McuInitialized = RESET;

/**
 * @brief Fix values of the ADC configuration
 */
static const uint32_t adcinit_ClockPrescaler = LL_ADC_CLOCK_SYNC_PCLK_DIV2;
static const uint32_t adcinit_LowPowerAutoPowerOff = LL_ADC_LP_MODE_NONE;
static const uint32_t adcinit_LowPowerFrequencyMode = LL_ADC_CLOCK_FREQ_MODE_LOW;
static const uint32_t adcinit_LowPowerAutoWait = LL_ADC_LP_MODE_NONE;
static const uint32_t adcinit_Resolution = LL_ADC_RESOLUTION_12B;
static const uint32_t adcinit_SamplingTime = LL_ADC_SAMPLINGTIME_160CYCLES_5;
static const uint32_t adcinit_ScanConvMode = LL_ADC_REG_SEQ_SCAN_DIR_FORWARD;
static const uint32_t adcinit_DataAlign = LL_ADC_DATA_ALIGN_RIGHT;
static const uint32_t adcinit_ContinuousConvMode = LL_ADC_REG_CONV_SINGLE;
static const uint32_t adcinit_ExternalTrigConvEdge = 0x0; /* 0 if no IT, LL_ADC_REG_TRIG_EXT_RISING... otherwise */
static const uint32_t adcinit_EOCSelection = LL_ADC_FLAG_EOC; /* same as ADC_EOC_SINGLE_CONV */
static const uint32_t adcinit_DMAContinuousRequests = ADC_CFGR1_DMACFG;
static const uint32_t adcinit_Overrun = LL_ADC_REG_OVR_DATA_PRESERVED;
static const uint32_t adcinit_ExternalTrigConv = LL_ADC_REG_TRIG_SOFTWARE;
static ADC_TypeDef *adcinit_Instance = ADC1;
#ifdef USE_FULL_ASSERT
static const uint32_t adcinit_OversamplingMode = DISABLE;
static const uint32_t adcinit_DiscontinuousConvMode = DISABLE;
#endif

/* Private function prototypes -----------------------------------------------*/
/* following provided LL function lacks a header in a .h file */
uint32_t RCC_PLL_GetFreqDomain_SYS( void );

/**
 * @brief  This function Initializes the hardware Ios
 * @param  None
 * @retval None
 */
static void HW_IoInit( void );

/**
 * @brief  This function Deinitializes the hardware Ios
 * @param  None
 * @retval None
 */
static void HW_IoDeInit( void );

/**
 * @brief  Initializes the RCC Oscillators according to the following fixed parameters:
 *            RCC_OscInitTypeDef RCC_OscInitStruct;
 *            RCC_OscInitStruct.OscillatorType      = RCC_OSCILLATORTYPE_HSI;
 *            RCC_OscInitStruct.HSEState            = RCC_HSE_OFF;
 *            RCC_OscInitStruct.HSIState            = RCC_HSI_ON;
 *            RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
 *            RCC_OscInitStruct.PLL.PLLState        = RCC_PLL_ON;
 *            RCC_OscInitStruct.PLL.PLLSource       = RCC_PLLSOURCE_HSI;
 *            RCC_OscInitStruct.PLL.PLLMUL          = RCC_PLLMUL_6;
 *            RCC_OscInitStruct.PLL.PLLDIV          = RCC_PLLDIV_3;
 * @param  None
 * @retval None
 * @note   LL implementation of HAL_RCC_OscConfig() for a specific implementation
 */
static void HW_RCC_OscConfig( void );

/**
 * @brief  Initializes the CPU, AHB and APB busses clocks according to the following fixed parameters:
 *            RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
 *            RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
 *            RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
 *            RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
 *            RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
 * @param  None
 * @retval None
 * @note   LL implementation of HAL_RCC_ClockConfig() for a specific implementation
 */
static void HW_RCC_ClockConfig( void );

/**
 * @brief  Return whether or not the ADC is enabled
 * @param  None
 * @retval 1 if enabled, 0 otherwise
 */
static uint32_t HW_ADC_IS_ENABLE( void );

/**
 * @brief  Initialize the ADC according to the adcinit_Instance parameters
 *         It follows the HAL_ADC_Init() function
 * @param  None
 * @retval None
 */
static void HW_ADC_Init( void );

/**
 * @brief  Delay during given micro seconds
 * @param  The number of micro seconds to wait
 * @retval None
 */
static void HW_ADC_DelayMicroSecond( uint32_t microSecond );

/**
 * @brief  Deselect all the channels.
 *         This is the same as HAL_ADC_ConfigChannel(), with channel=ADC_CHANNEL_MASK
 *         and rank=ADC_RANK_NONE
 * @param  none
 * @retval none
 */
static void HW_ADC_DeselectChannel( void );

/**
 * @brief  Select all the provided channel.
 *         This is the same as HAL_ADC_ConfigChannel(), with rank=ADC_RANK_CHANNEL_NUMBER
 * @param  The channel to select
 * @retval None
 */
static void HW_ADC_SelectChannel( uint32_t channel );

/**
 * @brief  Enable the ADC.
 * @note   Prerequisite condition to use this function: ADC must be disabled
 *         and voltage regulator must be enabled (done into HAL_ADC_Init()).
 * @note   If low power mode AutoPowerOff is enabled, power-on/off phases are
 * @param  None
 * @retval None
 */
static ErrorStatus HW_ADC_Enable( void );

/**
 * @brief  Enables ADC, starts conversion of regular group.
 *         Interruptions enabled in this function: None.
 * @param  None
 * @retval None
 */
static void HW_ADC_Start( void );

/**
 * @brief  Wait for regular group conversion to be completed.
 * @note   ADC conversion flags EOS (end of sequence) and EOC (end of
 *         conversion) are cleared by this function, with an exception:
 *         if low power feature "LowPowerAutoWait" is enabled, flags are
 *         not cleared to not interfere with this feature until data register
 *         is read using function HAL_ADC_GetValue().
 * @note   This function cannot be used in a particular setup: ADC configured
 *         in DMA mode and polling for end of each conversion (ADC init
 *         parameter "EOCSelection" set to ADC_EOC_SINGLE_CONV).
 *         In this case, DMA resets the flag EOC and polling cannot be
 *         performed on each conversion. Nevertheless, polling can still
 *         be performed on the complete sequence (ADC init
 *         parameter "EOCSelection" set to ADC_EOC_SEQ_CONV).
 * @param  none
 * @retval none
 */
static void HW_ADC_PollForConversion( void );

/**
 * @brief  This function initializes the ADC
 * @param  none
 * @retval none
 */
static void HW_AdcInit( void );

/**
 * @brief  This function reads a given channel
 * @param  Channel to read
 * @retval Value that was read
 */
static uint16_t HW_AdcReadChannel( uint32_t Channel );

/* Exported functions ---------------------------------------------------------*/
#define SYS_LED_PORT                   APP_LED_PORT
#define SYS_LED_PIN                    APP_LED_PIN

void SYS_LED_ON( void )
{
    SYS_LED_PORT->BSRR = SYS_LED_PIN;
}

