alibaba/AliOS-Things/board/m400/hal/m400_hw.c
void SYS_LED_OFF( void )
{
    SYS_LED_PORT->BRR = SYS_LED_PIN;
}

void SYS_LED_Deinit( void )
{
#if 0
    GPIO_InitTypeDef GPIO_InitStruct = { 0 };

    GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
    GPIO_InitStruct.Pull = GPIO_NOPULL;

    HW_GPIO_Init( SYS_LED_PORT, SYS_LED_PIN, &GPIO_InitStruct );
#endif
}

void SYS_LED_Init( void )
{
    GPIO_InitTypeDef GPIO_InitStruct = { 0 };

    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;

    HW_GPIO_Init( SYS_LED_PORT, SYS_LED_PIN, &GPIO_InitStruct );
#if 0
    SYS_LED_OFF( );
#endif
}

void HW_Reset( void )
{
    NVIC_SystemReset();
}

void HW_Init( void )
{
    if ( McuInitialized == RESET )
    {
        HW_GpioInit( );
#if defined(USE_BOOTLOADER)
        /* Set the Vector Table base location at 0x3000 */
        NVIC_SetVectorTable(NVIC_VectTab_FLASH, 0x3000);
#endif

        Radio.IoInit( );
        HW_SPI_Init( );
        HW_RTC_Init( );

#ifdef LORA_DEBUG
        vcom_Init( );
        SYS_LED_Init( );
#endif

        McuInitialized = SET;
    }
}

void HW_DeInit( void )
{
    HW_SPI_DeInit( );
    Radio.IoDeInit( );

#ifdef LORA_DEBUG
    vcom_DeInit( );
    SYS_LED_Deinit( );
#endif

    McuInitialized = RESET;
}

void HW_GpioInit( void )
{
    GPIO_InitTypeDef GPIO_InitStruct = { 0 };

    /* Configure all GPIO as analog to reduce current consumption on non used IOs */
    /* Clocks are enabled in HW_GPIO_Init on GPIO A, B, C and H*/

    GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    /* All GPIOs except debug pins (SWCLK and SWD) */
    HW_GPIO_Init( GPIOA, GPIO_PIN_All & (~(GPIO_PIN_13 | GPIO_PIN_14)), &GPIO_InitStruct );

    /* All GPIOs */
    HW_GPIO_Init( GPIOB, GPIO_PIN_All, &GPIO_InitStruct );
    HW_GPIO_Init( GPIOC, GPIO_PIN_All, &GPIO_InitStruct );
    HW_GPIO_Init( GPIOH, GPIO_PIN_All, &GPIO_InitStruct );

    /* Disable GPIOs clock */
    LL_IOP_GRP1_DisableClock( LL_IOP_GRP1_PERIPH_GPIOA );
    LL_IOP_GRP1_DisableClock( LL_IOP_GRP1_PERIPH_GPIOB );
    LL_IOP_GRP1_DisableClock( LL_IOP_GRP1_PERIPH_GPIOC );
    LL_IOP_GRP1_DisableClock( LL_IOP_GRP1_PERIPH_GPIOH );
}

void SystemClock_Config( void )
{
    HW_RCC_OscConfig( );

    /* Set Voltage scale1 as MCU will run at 32MHz */
    LL_APB1_GRP1_EnableClock( LL_APB1_GRP1_PERIPH_PWR );
    LL_PWR_SetRegulVoltageScaling( LL_PWR_REGU_VOLTAGE_SCALE1 );

    /* Poll VOSF bit of in PWR_CSR. Wait until it is reset to 0 */
    while ( LL_PWR_IsActiveFlag_VOSF( ) != RESET )
    {
    };

    /*
     * Select PLL as system clock source and configure the HCLK, PCLK1 and PCLK2
     * clocks dividers
     */
    HW_RCC_ClockConfig( );
}

uint32_t HW_GetRandomSeed( void )
{
    return ((*(uint32_t *) ID1) ^ (*(uint32_t *) ID2) ^ (*(uint32_t *) ID3));
}

void HW_GetUniqueId( uint8_t *id )
{
    uint32_t id1 = *((uint32_t *) ID1);
    uint32_t id2 = *((uint32_t *) ID2);
    uint32_t id3 = *((uint32_t *) ID3);
    uint32_t id13 = id1 + id3;

    id[7] = id13 >> 24;
    id[6] = id13 >> 16;
    id[5] = id13 >> 8;
    id[4] = id13;
    id[3] = id2 >> 24;
    id[2] = id2 >> 16;
    id[1] = id2 >> 8;
    id[0] = id2;
}

uint8_t HW_GetBatteryLevel( void )
{
    uint8_t batteryLevel = 0;
    uint16_t measuredLevel = 0;
    uint32_t batteryLevelmV;

    measuredLevel = HW_AdcReadChannel( LL_ADC_CHANNEL_VREFINT );

    if ( measuredLevel == 0 )
    {
        batteryLevelmV = 0;
    }
    else
    {
        batteryLevelmV = (((uint32_t) VDDA_VREFINT_CAL * (*VREFINT_CAL)) / measuredLevel);
    }
    if ( batteryLevelmV > VDD_BAT )
    {
        batteryLevel = LORAWAN_MAX_BAT;
    }
    else if ( batteryLevelmV < VDD_MIN )
    {
        batteryLevel = 0;
    }
    else
    {
        batteryLevel = (((uint32_t) (batteryLevelmV - VDD_MIN) * LORAWAN_MAX_BAT) / (VDD_BAT - VDD_MIN));
    }
    return batteryLevel;
}

void HW_EnterStopMode( void )
{
    uint32_t tmpreg = 0U;
    CPSR_ALLOC();
    RHINO_CPU_INTRPT_DISABLE();

    HW_IoDeInit( );

    /*clear wake up flag*/
    LL_PWR_ClearFlag_WU( );

    /* Disable the UART Data Register not empty Interrupt */
    //LL_LPUART_DisableIT_RXNE( UARTX );

    RHINO_CPU_INTRPT_ENABLE();

    /* Enter Stop Mode - is a LL implementatin of HAL_PWR_EnterSTOPMode(PWR_LOWPOWERREGULATOR_ON, PWR_STOPENTRY_WFI) */
    /* Select the regulator state in Stop mode ---------------------------------*/
    tmpreg = PWR->CR;

    /* Clear PDDS and LPDS bits */
    CLEAR_BIT( tmpreg, (PWR_CR_PDDS | PWR_CR_LPSDSR) );

    /* Set LPSDSR bit according to PWR_Regulator value */
    SET_BIT( tmpreg, LL_PWR_REGU_LPMODES_LOW_POWER );

    /* Store the new value */
    PWR->CR = tmpreg;

    /* Set SLEEPDEEP bit of Cortex System Control Register */
    LL_LPM_EnableDeepSleep( );

    /* Select Stop mode entry --------------------------------------------------*/
    __WFI( );

    /* Reset SLEEPDEEP bit of Cortex System Control Register */
    LL_LPM_EnableSleep( );
}

void HW_ExitStopMode( void )
{
    /* Disable IRQ while the MCU is not running on HSI */
    CPSR_ALLOC();
    RHINO_CPU_INTRPT_DISABLE();

    /* After wake-up from STOP reconfigure the system clock */
    /* Enable HSI */
    LL_RCC_HSI_Enable( );

    /* Wait till HSI is ready */
    while ( LL_RCC_HSI_IsReady( ) == RESET )
    {
        ;
    }

    /* Enable PLL */
    LL_RCC_PLL_Enable( );
    /* Wait till PLL is ready */
    while ( LL_RCC_PLL_IsReady( ) == RESET )
    {
        ;
    }

    /* Select PLL as system clock source */
    LL_RCC_SetSysClkSource( LL_RCC_SYS_CLKSOURCE_PLL );

    /* Wait till PLL is used as system clock source */
    while ( LL_RCC_GetSysClkSource( ) != LL_RCC_SYS_CLKSOURCE_STATUS_PLL )
    {
        ;
    }

    /*initilizes the peripherals*/
    HW_IoInit( );

    RHINO_CPU_INTRPT_ENABLE();
}

void HW_EnterSleepMode( void )
{
    /* Is an implementation of HAL_PWR_EnterSLEEPMode(PWR_MAINREGULATOR_ON, PWR_SLEEPENTRY_WFI) */
    uint32_t tmpreg = 0U;

    /* Select the regulator state in Sleep mode ---------------------------------*/
    tmpreg = PWR->CR;

    /* Clear PDDS and LPDS bits */
    CLEAR_BIT( tmpreg, (PWR_CR_PDDS | PWR_CR_LPSDSR) );

    /* Set LPSDSR bit according to PWR_Regulator value */
    SET_BIT( tmpreg, LL_PWR_REGU_LPMODES_MAIN );

