alibaba/AliOS-Things/board/m400/hal/m400_hw.c
    /* Store the new value */
    PWR->CR = tmpreg;

    /* Clear SLEEPDEEP bit of Cortex System Control Register */
    LL_LPM_EnableSleep( );

    /* Select SLEEP mode entry -------------------------------------------------*/
    __WFI( );
}

/* Private functions ---------------------------------------------------------*/

static void HW_IoInit( void )
{
    HW_SPI_Init( );
    //HW_SPI_IoInit( );
    Radio.IoInit( );
#ifdef LORA_DEBUG
    vcom_Init( );
    SYS_LED_Init( );
#endif
    //vcom_IoInit();
}

static void HW_IoDeInit( void )
{
#if 0
    GPIO_InitTypeDef initStruct = { 0 };

    initStruct.Mode = GPIO_MODE_ANALOG;
    initStruct.Pull = GPIO_NOPULL;
    HW_GPIO_Init( RADIO_MOSI_PORT, RADIO_MOSI_PIN, &initStruct );
    HW_GPIO_Init( RADIO_MISO_PORT, RADIO_MISO_PIN, &initStruct );
    HW_GPIO_Init( RADIO_SCLK_PORT, RADIO_SCLK_PIN, &initStruct );
    HW_GPIO_Init( RADIO_NSS_PORT, RADIO_NSS_PIN, &initStruct );
#endif

    Radio.IoDeInit( );
#ifdef LORA_DEBUG
    vcom_DeInit( );
    SYS_LED_Deinit( );
#endif
    //vcom_IoDeInit();

    HW_SPI_DeInit( );
}

static void HW_RCC_OscConfig( void )
{
    uint32_t sys_clk;

    /* HSI configuration as the oscillator type */
    /* When the HSI is used as system clock it will not disabled */
    sys_clk = LL_RCC_GetSysClkSource( );
    if ( (sys_clk == LL_RCC_SYS_CLKSOURCE_STATUS_HSI) ||
         ((sys_clk == LL_RCC_SYS_CLKSOURCE_STATUS_PLL) && (LL_RCC_PLL_GetMainSource( ) == LL_RCC_PLLSOURCE_HSI)) )
    {
        /* nothing to do apart the calibration which is performed later on */
    }
    else
    {
        /* Enable the Internal High Speed oscillator (HSI or HSIdiv4 */
        LL_RCC_HSI_Enable( );

        /* Wait till HSI is ready */
        while ( LL_RCC_HSI_IsReady( ) == RESET )
        {
            ;
        }
    }

    /* Adjusts the Internal High Speed oscillator (HSI) calibration value.*/
    LL_RCC_HSI_SetCalibTrimming( RCC_HSICALIBRATION_DEFAULT );

    /*-------------------------------- PLL Configuration -----------------------*/
    /* Check if the PLL is used as system clock or not */
    if ( LL_RCC_GetSysClkSource( ) != LL_RCC_SYS_CLKSOURCE_STATUS_PLL )
    {
        {
            /* Disable the main PLL. */
            LL_RCC_PLL_Disable( );

            /* Wait till PLL is ready */
            while ( LL_RCC_PLL_IsReady( ) != RESET )
            {
                ;
            }

            /* Configure the main PLL clock source, multiplication and division factors. */
            LL_RCC_PLL_ConfigDomain_SYS( LL_RCC_PLLSOURCE_HSI, RCC_CFGR_PLLMUL6, LL_RCC_PLL_DIV_3 );

            /* Enable the main PLL. */
            LL_RCC_PLL_Enable( );

            /* Wait till PLL is ready */
            while ( LL_RCC_PLL_IsReady( ) == RESET )
            {
                ;
            }
        }
    }
    else
    {
        Error_Handler( );
    }
}

static void HW_RCC_ClockConfig( void )
{
    /*
     * To correctly read data from FLASH memory, the number of wait states (LATENCY)
     * must be correctly programmed according to the frequency of the CPU clock
     * (HCLK) and the supply voltage of the device.
     */

    /* Increasing the CPU frequency */
    if ( LL_FLASH_LATENCY_1 > LL_FLASH_GetLatency( ) )
    {
        /* Program the new number of wait states to the LATENCY bits in the FLASH_ACR register */
        LL_FLASH_SetLatency( LL_FLASH_LATENCY_1 );

        /*
         * Check that the new number of wait states is taken into account to access the Flash
         * memory by reading the FLASH_ACR register
         */
        if ( LL_FLASH_GetLatency( ) != LL_FLASH_LATENCY_1 )
        {
            Error_Handler( );
        }
    }

    /*-------------------------- HCLK Configuration --------------------------*/
    LL_RCC_SetAHBPrescaler( LL_RCC_SYSCLK_DIV_1 );

    /*------------------------- SYSCLK Configuration ---------------------------*/
    /* Check the PLL ready flag */
    if ( LL_RCC_PLL_IsReady( ) == RESET )
    {
        Error_Handler( );
    }
    LL_RCC_SetSysClkSource( LL_RCC_SYS_CLKSOURCE_PLL );
    while ( LL_RCC_GetSysClkSource( ) != LL_RCC_SYS_CLKSOURCE_STATUS_PLL )
    {
        ;
    }

    if ( LL_FLASH_LATENCY_1 <= LL_FLASH_GetLatency( ) )
    {
        /* Program the new number of wait states to the LATENCY bits in the FLASH_ACR register */
        LL_FLASH_SetLatency( LL_FLASH_LATENCY_1 );

        /*
         * Check that the new number of wait states is taken into account to access the Flash
         * memory by reading the FLASH_ACR register
         */
        if ( LL_FLASH_GetLatency( ) != LL_FLASH_LATENCY_1 )
        {
            Error_Handler( );
        }
    }

    /*-------------------------- PCLK1 Configuration ---------------------------*/
    LL_RCC_SetAPB1Prescaler( LL_RCC_APB1_DIV_1 );

    /*-------------------------- PCLK2 Configuration ---------------------------*/
    LL_RCC_SetAPB2Prescaler( LL_RCC_APB2_DIV_1 );

    /* Update the SystemCoreClock global variable */
    SystemCoreClock = RCC_PLL_GetFreqDomain_SYS( ) >> AHBPrescTable[LL_RCC_GetAHBPrescaler( ) >> 4];

    /* Configure the source of time base considering new system clocks settings*/
    /* No need to call HAL_InitTick(TICK_INT_PRIORITY) as not used */
}

static uint32_t HW_ADC_IS_ENABLE( void )
{
    return (LL_ADC_IsActiveFlag_ADRDY( adcinit_Instance ) &&
            LL_ADC_IsEnabled( adcinit_Instance )
            &&
            !LL_ADC_IsDisableOngoing( adcinit_Instance ));
}

static void HW_ADC_Init( void )
{
    /* Check the parameters */
    assert_param( IS_ADC_ALL_INSTANCE(adcinit_Instance) );
    assert_param( (adcinit_ClockPrescaler == LL_ADC_CLOCK_SYNC_PCLK_DIV1) ||
                  (adcinit_ClockPrescaler == LL_ADC_CLOCK_SYNC_PCLK_DIV2) ||
                  (adcinit_ClockPrescaler == LL_ADC_CLOCK_SYNC_PCLK_DIV4) );
    assert_param( (adcinit_Resolution == LL_ADC_RESOLUTION_12B) ||
                  (adcinit_Resolution == LL_ADC_RESOLUTION_10B) ||
                  (adcinit_Resolution == LL_ADC_RESOLUTION_8B) ||
                  (adcinit_Resolution == LL_ADC_RESOLUTION_6B) );
    assert_param( (adcinit_SamplingTime == LL_ADC_SAMPLINGTIME_1CYCLE_5) ||
                  (adcinit_SamplingTime == LL_ADC_SAMPLINGTIME_7CYCLES_5) ||
                  (adcinit_SamplingTime == LL_ADC_SAMPLINGTIME_12CYCLES_5) ||
                  (adcinit_SamplingTime == LL_ADC_SAMPLINGTIME_19CYCLES_5) ||
                  (adcinit_SamplingTime == LL_ADC_SAMPLINGTIME_39CYCLES_5) ||
                  (adcinit_SamplingTime == LL_ADC_SAMPLINGTIME_79CYCLES_5) ||
                  (adcinit_SamplingTime == LL_ADC_SAMPLINGTIME_160CYCLES_5) );
    assert_param( (adcinit_ScanConvMode == LL_ADC_REG_SEQ_SCAN_DIR_FORWARD) ||
                  (adcinit_ScanConvMode == LL_ADC_REG_SEQ_SCAN_DIR_BACKWARD) );
    assert_param( (adcinit_DataAlign == LL_ADC_DATA_ALIGN_RIGHT) ||
                  (adcinit_DataAlign == LL_ADC_DATA_ALIGN_LEFT) );
    assert_param( (adcinit_ContinuousConvMode == LL_ADC_REG_CONV_SINGLE) ||
                  (adcinit_ContinuousConvMode == LL_ADC_REG_CONV_CONTINUOUS) );
    assert_param( IS_FUNCTIONAL_STATE(adcinit_DiscontinuousConvMode) );
    assert_param( (adcinit_ExternalTrigConvEdge == 0) ||
                  (adcinit_ExternalTrigConvEdge == LL_ADC_REG_TRIG_EXT_RISING) ||
                  (adcinit_ExternalTrigConvEdge == LL_ADC_REG_TRIG_EXT_FALLING) ||
                  (adcinit_ExternalTrigConvEdge == LL_ADC_REG_TRIG_EXT_RISINGFALLING) );
    assert_param( adcinit_ExternalTrigConv == LL_ADC_REG_TRIG_SOFTWARE );
    /* note that DMA configuration should be LL_ADC_REG_DMA_TRANSFER_NONE,
     LL_ADC_REG_DMA_TRANSFER_LIMITED, or LL_ADC_REG_DMA_TRANSFER_UNLIMITED */
    assert_param( (adcinit_DMAContinuousRequests == ADC_CFGR1_DMACFG) );
    assert_param( (adcinit_Overrun == LL_ADC_REG_OVR_DATA_PRESERVED) ||
                  (adcinit_Overrun == LL_ADC_REG_OVR_DATA_OVERWRITTEN) );
    assert_param( (adcinit_LowPowerAutoWait == LL_ADC_LP_MODE_NONE) ||
                  (adcinit_LowPowerAutoWait == LL_ADC_LP_AUTOWAIT) );
    assert_param( adcinit_LowPowerFrequencyMode == LL_ADC_CLOCK_FREQ_MODE_LOW ||
                  adcinit_LowPowerFrequencyMode == LL_ADC_CLOCK_FREQ_MODE_HIGH );
    assert_param( (adcinit_LowPowerAutoPowerOff == LL_ADC_LP_MODE_NONE) ||
                  (adcinit_LowPowerAutoPowerOff == LL_ADC_LP_AUTOPOWEROFF) );
    assert_param( IS_FUNCTIONAL_STATE(adcinit_OversamplingMode) );

    /* As prerequisite, into HAL_ADC_MspInit(), ADC clock must be configured    */
    /* at RCC top level depending on both possible clock sources:               */
    /* APB clock or HSI clock.                                                  */
    /* Refer to header of this file for more details on clock enabling procedure*/

    /* Actions performed only if ADC is coming from state reset:                */
    /* - Initialization of ADC MSP                                              */
    /* - ADC voltage regulator enable                                           */
    if ( adc_state == HAL_ADC_STATE_RESET )
    {
        /* Init the low level hardware */
        /* no call to HAL_ADC_MspInit(); is performed as no action is required */
    }

    /* Configuration of ADC parameters if previous preliminary actions are      */
    /* correctly completed.                                                     */
    /* and if there is no conversion on going on regular group (ADC can be      */
    /* enabled anyway, in case of call of this function to update a parameter   */
    /* on the fly).                                                             */
    if ( (READ_BIT( adc_state, HAL_ADC_STATE_ERROR_INTERNAL )) ||
         (LL_ADC_REG_IsConversionOngoing( adcinit_Instance ) != RESET) )
    {
        /* Update ADC state machine to error */
        SET_BIT( adc_state, HAL_ADC_STATE_ERROR_INTERNAL );

        return;
    }

