alibaba/AliOS-Things/board/m400/hal/m400_hw.c
    /* Set ADC state */
    CLEAR_BIT( adc_state, HAL_ADC_STATE_REG_BUSY );
    SET_BIT( adc_state, HAL_ADC_STATE_ERROR_INTERNAL );

    /* Parameters update conditioned to ADC state:                            */
    /* Parameters that can be updated only when ADC is disabled:              */
    /*  - ADC clock mode                                                      */
    /*  - ADC clock prescaler                                                 */
    /*  - ADC Resolution                                                      */
    if ( !HW_ADC_IS_ENABLE( ) )
    {
        /* Some parameters of this register are not reset, since they are set   */
        /* by other functions and must be kept in case of usage of this         */
        /* without needing to reconfigure all other ADC groups/channels         */
        /* parameters):                                                         */
        /*   - internal measurement paths: Vbat, temperature sensor, Vref       */
        /*     (set into HAL_ADC_ConfigChannel() )                              */

        /*
         * Configuration of ADC clock: clock source PCLK or asynchronous with
         * selectable prescaler - same as __HAL_ADC_CLOCK_PRESCALER()
         */
        assert_param( (adcinit_ClockPrescaler == LL_ADC_CLOCK_SYNC_PCLK_DIV1) ||
                      (adcinit_ClockPrescaler == LL_ADC_CLOCK_SYNC_PCLK_DIV2) ||
                      (adcinit_ClockPrescaler == LL_ADC_CLOCK_SYNC_PCLK_DIV4) );
        LL_ADC_SetClock( adcinit_Instance, adcinit_ClockPrescaler );

        /* Configuration of ADC:                                                */
        /*  - Resolution                                                        */
        LL_ADC_SetResolution( adcinit_Instance, adcinit_Resolution );
    }

    /* Set the Low Frequency mode */
    LL_ADC_SetCommonFrequencyMode( ADC, adcinit_LowPowerFrequencyMode );

    /* Enable voltage regulator (if disabled at this step) */
    if ( !LL_ADC_IsInternalRegulatorEnabled( adcinit_Instance ) )
    {
        /* Set ADVREGEN bit */
        LL_ADC_EnableInternalRegulator( adcinit_Instance );

        /*
         * Note that this is not the original code which was:
         *    adcinit_Instance->CR |= ADC_CR_ADVREGEN;
         */
    }

    /* Configuration of ADC:                                                    */
    /*  - Resolution                                                            */
    /*  - Data alignment                                                        */
    /*  - Scan direction                                                        */
    /*  - External trigger to start conversion                                  */
    /*  - External trigger polarity                                             */
    /*  - Continuous conversion mode                                            */
    /*  - DMA continuous request                                                */
    /*  - Overrun                                                               */
    /*  - AutoDelay feature                                                     */
    /*  - Discontinuous mode                                                    */
    MODIFY_REG( adcinit_Instance->CFGR1,
                (ADC_CFGR1_ALIGN |
                ADC_CFGR1_SCANDIR |
                ADC_CFGR1_EXTSEL |
                ADC_CFGR1_EXTEN |
                ADC_CFGR1_CONT |
                ADC_CFGR1_DMACFG |
                ADC_CFGR1_OVRMOD |
                ADC_CFGR1_AUTDLY |
                ADC_CFGR1_AUTOFF |
                ADC_CFGR1_DISCEN),
                (adcinit_DataAlign |
                 adcinit_ScanConvMode
                 |
                 adcinit_ContinuousConvMode
                 |
                 adcinit_DMAContinuousRequests
                 |
                 adcinit_Overrun
                 |
                 adcinit_LowPowerAutoWait
                 |
                 adcinit_LowPowerAutoPowerOff) );

    /* Enable external trigger if trigger selection is different of software  */
    /* start.                                                                 */
    /* Note: This configuration keeps the hardware feature of parameter       */
    /*       ExternalTrigConvEdge "trigger edge none" equivalent to           */
    /*       software start.                                                  */
    if ( adcinit_ExternalTrigConv != LL_ADC_REG_TRIG_SOFTWARE )
    {
        LL_ADC_REG_SetTriggerSource( adcinit_Instance, adcinit_ExternalTrigConv );
        LL_ADC_REG_SetTriggerEdge( adcinit_Instance, adcinit_ExternalTrigConvEdge );
    }

    assert_param( adcinit_DiscontinuousConvMode != ENABLE );
    assert_param( adcinit_OversamplingMode != ENABLE );
    if ( LL_ADC_GetOverSamplingScope( adcinit_Instance ) != LL_ADC_OVS_DISABLE )
    {
        /* Disable OverSampling mode if needed */
        LL_ADC_SetOverSamplingScope( adcinit_Instance, LL_ADC_OVS_DISABLE );
    }

    /* Set the new sample time */
    LL_ADC_SetSamplingTimeCommonChannels( adcinit_Instance, adcinit_SamplingTime );

    /* Set the ADC state */
    CLEAR_BIT( adc_state, HAL_ADC_STATE_BUSY_INTERNAL );
    SET_BIT( adc_state, HAL_ADC_STATE_READY );
}

static void HW_ADC_DelayMicroSecond( uint32_t microSecond )
{
    /* Compute number of CPU cycles to wait for */
    __IO uint32_t waitLoopIndex = ((microSecond * SystemCoreClock) / 1000000U);

    while ( waitLoopIndex != 0U )
    {
        waitLoopIndex--;
    }
}

static void HW_ADC_DeselectChannel( void )
{
    /* Parameters update conditioned to ADC state:                              */
    /* Parameters that can be updated when ADC is disabled or enabled without   */
    /* conversion on going on regular group:                                    */
    /*  - Channel number                                                        */
    /*  - Management of internal measurement channels: Vbat/VrefInt/TempSensor  */
    if ( LL_ADC_REG_IsConversionOngoing( adcinit_Instance ) )
    {
        /* Update ADC state machine to error */
        SET_BIT( adc_state, HAL_ADC_STATE_ERROR_CONFIG );
        return;
    }

    /* Regular sequence configuration */
    /* Reset the channel selection register from the selected channel */
    LL_ADC_REG_SetSequencerChRem( adcinit_Instance, ADC_AWD_CR_ALL_CHANNEL_MASK );
    LL_ADC_SetCommonPathInternalCh( ADC, LL_ADC_PATH_INTERNAL_NONE );
}

static void HW_ADC_SelectChannel( uint32_t channel )
{
    uint32_t value = LL_ADC_PATH_INTERNAL_NONE;
    uint32_t delay = 0;

    /* Parameters update conditioned to ADC state:                              */
    /* Parameters that can be updated when ADC is disabled or enabled without   */
    /* conversion on going on regular group:                                    */
    /*  - Channel number                                                        */
    /*  - Management of internal measurement channels: Vbat/VrefInt/TempSensor  */
    if ( LL_ADC_REG_IsConversionOngoing( adcinit_Instance ) )
    {
        /* Update ADC state machine to error */
        SET_BIT( adc_state, HAL_ADC_STATE_ERROR_CONFIG );
        return;
    }

    /* Enable selected channels */
    LL_ADC_REG_SetSequencerChAdd( adcinit_Instance, channel );

    /* If Temperature sensor channel is selected, then enable the internal      */
    /* buffers and path  */
    channel = channel & ADC_AWD_CR_ALL_CHANNEL_MASK;
    if ( (channel & LL_ADC_CHANNEL_TEMPSENSOR) == (LL_ADC_CHANNEL_TEMPSENSOR & ADC_AWD_CR_ALL_CHANNEL_MASK) )
    {
        value |= LL_ADC_PATH_INTERNAL_TEMPSENSOR;
        delay = LL_ADC_DELAY_TEMPSENSOR_STAB_US; /* Delay for temperature sensor stabilization time */
    }

    /* If VRefInt channel is selected, then enable the internal buffers and path   */
    if ( (channel & LL_ADC_CHANNEL_VREFINT) == (LL_ADC_CHANNEL_VREFINT & ADC_AWD_CR_ALL_CHANNEL_MASK) )
    {
        value |= LL_ADC_PATH_INTERNAL_VREFINT;
    }

