alibaba/AliOS-Things/board/m400/hal/m400_hw.c
#if defined(STM32L053xx) || defined(STM32L063xx) || defined(STM32L073xx) || defined(STM32L083xx)
    /* If Vlcd channel is selected, then enable the internal buffers and path   */
    if ( (channel & LL_ADC_CHANNEL_VLCD) == (LL_ADC_CHANNEL_VLCD & ADC_AWD_CR_ALL_CHANNEL_MASK) )
    {
        value |= LL_ADC_PATH_INTERNAL_VLCD;
    }
#endif

    LL_ADC_SetCommonPathInternalCh( ADC, value );
    if ( delay )
    {
        HW_ADC_DelayMicroSecond( delay );
    }
}

static ErrorStatus HW_ADC_Enable( void )
{
    /* ADC enable and wait for ADC ready (in case of ADC is disabled or         */
    /* enabling phase not yet completed: flag ADC ready not yet set).           */
    /* Timeout implemented to not be stuck if ADC cannot be enabled (possible   */
    /* causes: ADC clock not running, ...).                                     */
    if ( !HW_ADC_IS_ENABLE( ) )
    {
        /* Check if conditions to enable the ADC are fulfilled */
        /* same as "if (ADC_ENABLING_CONDITIONS() == RESET)" */
        if ( READ_BIT(adcinit_Instance->CR, ADC_CR_BITS_PROPERTY_RS) == RESET )
        {
            /* Update ADC state machine to error */
            SET_BIT( adc_state, HAL_ADC_STATE_ERROR_INTERNAL );
            return ERROR;
        }

        /* Enable the ADC peripheral */
        LL_ADC_Enable( adcinit_Instance );

        /* Delay for ADC stabilization time. */
        HW_ADC_DelayMicroSecond( ADC_STAB_DELAY_US );

        /* Wait for ADC effectively enabled */
        while ( !LL_ADC_IsActiveFlag_ADRDY( adcinit_Instance ) )
        {
            ;
        }
    }

    return SUCCESS;
}

static void HW_ADC_Start( )
{
    uint32_t status = SUCCESS;

    /* Perform ADC enable and conversion start if no conversion is on going */
    if ( !LL_ADC_REG_IsConversionOngoing( adcinit_Instance ) )
    {
        /* Enable the ADC peripheral */
        /* If low power mode AutoPowerOff is enabled, power-on/off phases are       */
        /* performed automatically by hardware.                                     */
        if ( adcinit_LowPowerAutoPowerOff != LL_ADC_LP_AUTOPOWEROFF )
        {
            status = HW_ADC_Enable( );
        }

        /* Start conversion if ADC is effectively enabled */
        if ( status == SUCCESS )
        {
            /* Set ADC state                                                        */
            /* - Clear state bitfield related to regular group conversion results   */
            /* - Set state bitfield related to regular operation                    */
            CLEAR_BIT( adc_state,
                       HAL_ADC_STATE_READY | HAL_ADC_STATE_REG_EOC | HAL_ADC_STATE_REG_OVR | HAL_ADC_STATE_REG_EOSMP );
            SET_BIT( adc_state, HAL_ADC_STATE_REG_BUSY );

            /* Clear regular group conversion flag and overrun flag */
            /* (To ensure of no unknown state from potential previous ADC           */
            /* operations)                                                          */
            WRITE_REG( adcinit_Instance->ISR, (LL_ADC_FLAG_EOC | LL_ADC_FLAG_EOS | LL_ADC_FLAG_OVR) );

            /* Enable conversion of regular group.                                  */
            /* If software start has been selected, conversion starts immediately.  */
            /* If external trigger has been selected, conversion will start at next */
            /* trigger event.                                                       */
            LL_ADC_REG_StartConversion( adcinit_Instance );
        }
    }
}

static void HW_ADC_PollForConversion( )
{
    /* Check the parameters */
    assert_param( IS_ADC_ALL_INSTANCE(adcinit_Instance) );
    assert_param( (adcinit_EOCSelection == LL_ADC_FLAG_EOC) || (adcinit_EOCSelection == LL_ADC_FLAG_EOS) );

    /* If end of conversion selected to end of sequence */
    if ( adcinit_EOCSelection == LL_ADC_FLAG_EOS )
    {
        Error_Handler( ); /* EOS is not implemented */
    }
    /* If end of conversion selected to end of each conversion */
    else /* ADC_EOC_SINGLE_CONV */
    {
        /* Verification that ADC configuration is compliant with polling for      */
        /* each conversion:                                                       */
        /* Particular case is ADC configured in DMA mode and ADC sequencer with   */
        /* several ranks and polling for end of each conversion.                  */
        /* For code simplicity sake, this particular case is generalized to       */
        /* ADC configured in DMA mode and and polling for end of each conversion. */
        if ( READ_BIT( adcinit_Instance->CFGR1, ADC_CFGR1_DMAEN ) )
        {
            /* Update ADC state machine to error */
            SET_BIT( adc_state, HAL_ADC_STATE_ERROR_CONFIG );
            return;
        }
    }

    /* Wait until End of Conversion flag is raised */
    while ( LL_ADC_IsActiveFlag_EOC( adcinit_Instance ) == 0 )
    {
        ;
    }
    while ( LL_ADC_REG_IsConversionOngoing( adcinit_Instance ) )
    {
        ;
    }

    /* Update ADC state machine */
    SET_BIT( adc_state, HAL_ADC_STATE_REG_EOC );

    /* Determine whether any further conversion upcoming on group regular       */
    /* by external trigger, continuous mode or scan sequence on going.          */
    if ( LL_ADC_REG_IsTriggerSourceSWStart( adcinit_Instance ) &&
         (adcinit_ContinuousConvMode == LL_ADC_REG_CONV_SINGLE) )
    {
        if ( LL_ADC_IsActiveFlag_EOS( adcinit_Instance ) )
        {
            /* Allowed to modify bits ADC_IT_EOC/ADC_IT_EOS only if bit             */
            /* ADSTART==0 (no conversion on going)                                  */
            if ( !LL_ADC_REG_IsConversionOngoing( adcinit_Instance ) )
            {
                /* Disable ADC end of single conversion interrupt on group regular */
                /* Note: Overrun interrupt was enabled with EOC interrupt in          */
                /* HAL_Start_IT(), but is not disabled here because can be used       */
                /* by overrun IRQ process below.                                      */
                LL_ADC_DisableIT_EOS( adcinit_Instance );
                LL_ADC_DisableIT_EOC( adcinit_Instance );

