alibaba/AliOS-Things/board/m400/hal/m400_hw.c
                /* Set ADC state */
                CLEAR_BIT( adc_state, HAL_ADC_STATE_REG_BUSY );
                SET_BIT( adc_state, HAL_ADC_STATE_READY );
            }
            else
            {
                /* Change ADC state to error state */
                SET_BIT( adc_state, HAL_ADC_STATE_ERROR_CONFIG );
            }
        }
    }

    /*
     * Clear end of conversion flag of regular group if low power feature
     * "LowPowerAutoWait " is disabled, to not interfere with this feature
     * until data register is read using function HAL_ADC_GetValue().
     */
    if ( adcinit_LowPowerAutoWait == LL_ADC_LP_MODE_NONE )
    {
        /* Clear regular group conversion flag */
        LL_ADC_ClearFlag_EOC( adcinit_Instance );
    }
}

static void HW_AdcInit( void )
{
    if ( AdcInitialized == RESET )
    {
        AdcInitialized = SET;

        LL_APB2_GRP1_EnableClock( LL_APB2_GRP1_PERIPH_ADC1 );
        HW_ADC_Init( );
        LL_ADC_StartCalibration( adcinit_Instance );
        while ( LL_ADC_IsCalibrationOnGoing( adcinit_Instance ) == 0 )
        {
            ;
        }
        LL_APB2_GRP1_DisableClock( LL_APB2_GRP1_PERIPH_ADC1 );
    }
}

static uint16_t HW_AdcReadChannel( uint32_t Channel )
{
    uint16_t adcData = 0;
    if ( AdcInitialized == SET )
    {
        LL_APB2_GRP1_EnableClock( LL_APB2_GRP1_PERIPH_ADC1 );
        /* wait the the Vrefint used by adc is set */
        while ( LL_PWR_IsActiveFlag_VREFINTRDY( ) == RESET )
        {
            ;
        }

        /*calibrate ADC if any calibraiton hardware*/
        LL_ADC_StartCalibration( adcinit_Instance );
        while ( LL_ADC_IsCalibrationOnGoing( adcinit_Instance ) == 0 )
        {
            ;
        }

        /* Enable the ADC, but after few cycles once the calibration is completed */
        volatile int i = 32 * LL_ADC_DELAY_CALIB_ENABLE_ADC_CYCLES;
        while ( i )
        {
            i--;
        }
        LL_ADC_Enable( adcinit_Instance );
        while ( LL_ADC_IsActiveFlag_ADRDY( adcinit_Instance ) == 0 )
        {
            ;
        }

        /* Deselects all channels*/
        HW_ADC_DeselectChannel( );

        /* configure adc channel */
        HW_ADC_SelectChannel( Channel );

        /* Start the conversion process */
        HW_ADC_Start( );

        /* Wait for the end of conversion */
        HW_ADC_PollForConversion( );

        /* Get the converted value of regular channel */
        adcData = LL_ADC_REG_ReadConversionData12( adcinit_Instance );

        /* Implementation of __HAL_ADC_DISABLE(__HANDLE__) */
        LL_ADC_Disable( adcinit_Instance );
        LL_ADC_ClearFlag_EOSMP( adcinit_Instance );
        LL_ADC_ClearFlag_ADRDY( adcinit_Instance );

        LL_APB2_GRP1_DisableClock( LL_APB2_GRP1_PERIPH_ADC1 );
    }
    return adcData;
}

uint32_t HW_Get_MFT_ID(void)
{
    return 0x1234;
}

uint32_t HW_Get_MFT_Model(void)
{
    return 0x4321;
}

uint32_t HW_Get_MFT_Rev(void)
{
    return 0x0001;
}

uint32_t HW_Get_MFT_SN(void)
{
    return 0xffff;
}

bool HW_Set_MFT_Baud(uint32_t baud)
{
    return true;
}

uint32_t HW_Get_MFT_Baud(void)
{
    return 115200;
}


/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
